In [29]:
import pandas as pd
import numpy as np
import pickle

#### В обучающей выборке train.csv:
* Признаки site_i – это индексы посещенных сайтов (расшифровка дана в pickle-файле со словарем site_dic.pkl)
* Признаки time_i – время посещения сайтов site_i

В проверочной выборке есть целевой признак target – факт того, что сессия принадлежит Alice.


#### Ответ для загрузки в систему
Нужно вычислить для каждой метки «id» файла test.csv вероятность принадлежности сессии Alice. Тестовый сабмит - baseline_1.csv, получен запуском бейзлайна.


Пример 5 строчек ответа:

session_id,target

1,0.948255

2,0.682483

3,0.502855

4,0.345556

## Подготовка данных

In [12]:
times = ['time'+str(i) for i in range(1,11)]
times

['time1',
 'time2',
 'time3',
 'time4',
 'time5',
 'time6',
 'time7',
 'time8',
 'time9',
 'time10']

In [23]:
train_df = pd.read_csv('../src/train.csv', index_col='session_id', parse_dates=times)
test_df = pd.read_csv('../src/test.csv', index_col='session_id', parse_dates=times)

In [20]:
train_df.head()

,site1,time1,site2,time2,site3,time3,site4,time4,site5,time5,...,time6,site7,time7,site8,time8,site9,time9,site10,time10,target
session_id,,,,,,,,,,,,,,,,,,,,,
1,718,2014-02-20 10:02:45,NaN,NaT,NaN,NaT,NaN,NaT,NaN,NaT,...,NaT,NaN,NaT,NaN,NaT,NaN,NaT,NaN,NaT,0
2,890,2014-02-22 11:19:50,941.0,2014-02-22 11:19:50,3847.0,2014-02-22 11:19:51,941.0,2014-02-22 11:19:51,942.0,2014-02-22 11:19:51,...,2014-02-22 11:19:51,3847.0,2014-02-22 11:19:52,3846.0,2014-02-22 11:19:52,1516.0,2014-02-22 11:20:15,1518.0,2014-02-22 11:20:16,0
3,14769,2013-12-16 16:40:17,39.0,2013-12-16 16:40:18,14768.0,2013-12-16 16:40:19,14769.0,2013-12-16 16:40:19,37.0,2013-12-16 16:40:19,...,2013-12-16 16:40:19,14768.0,2013-12-16 16:40:20,14768.0,2013-12-16 16:40:21,14768.0,2013-12-16 16:40:22,14768.0,2013-12-16 16:40:24,0
4,782,2014-03-28 10:52:12,782.0,2014-03-28 10:52:42,782.0,2014-03-28 10:53:12,782.0,2014-03-28 10:53:42,782.0,2014-03-28 10:54:12,...,2014-03-28 10:54:42,782.0,2014-03-28 10:55:12,782.0,2014-03-28 10:55:42,782.0,2014-03-28 10:56:12,782.0,2014-03-28 10:56:42,0
5,22,2014-02-28 10:53:05,177.0,2014-02-28 10:55:22,175.0,2014-02-28 10:55:22,178.0,2014-02-28 10:55:23,177.0,2014-02-28 10:55:23,...,2014-02-28 10:55:59,175.0,2014-02-28 10:55:59,177.0,2014-02-28 10:55:59,177.0,2014-02-28 10:57:06,178.0,2014-02-28 10:57:11,0

In [33]:
test_df.head()

,site1,time1,site2,time2,site3,time3,site4,time4,site5,time5,site6,time6,site7,time7,site8,time8,site9,time9,site10,time10
session_id,,,,,,,,,,,,,,,,,,,,
1,29,2014-04-10 11:19:53,35,2014-04-10 11:19:53,22,2014-04-10 11:19:54,321,2014-04-10 11:19:54,23,2014-04-10 11:19:54,2211,2014-04-10 11:19:54,6730,2014-04-10 11:19:54,21,2014-04-10 11:19:54,44582,2014-04-10 11:20:00,15336,2014-04-10 11:20:00
2,782,2014-03-07 11:00:28,782,2014-03-07 11:00:53,782,2014-03-07 11:00:58,782,2014-03-07 11:01:06,782,2014-03-07 11:01:09,782,2014-03-07 11:01:10,782,2014-03-07 11:01:23,782,2014-03-07 11:01:29,782,2014-03-07 11:01:30,782,2014-03-07 11:01:53
3,55,2014-05-12 15:55:12,55,2014-05-12 15:55:13,55,2014-05-12 15:55:14,55,2014-05-12 15:56:15,55,2014-05-12 15:56:16,55,2014-05-12 15:56:17,55,2014-05-12 15:56:18,55,2014-05-12 15:56:19,1445,2014-05-12 15:56:33,1445,2014-05-12 15:56:36
4,1023,2014-04-11 10:03:19,1022,2014-04-11 10:03:19,50,2014-04-11 10:03:20,222,2014-04-11 10:03:21,202,2014-04-11 10:03:21,3374,2014-04-11 10:03:22,50,2014-04-11 10:03:22,48,2014-04-11 10:03:22,48,2014-04-11 10:03:23,3374,2014-04-11 10:03:23
5,301,2014-05-16 15:05:31,301,2014-05-16 15:05:32,301,2014-05-16 15:05:33,66,2014-05-16 15:05:39,67,2014-05-16 15:05:40,69,2014-05-16 15:05:40,70,2014-05-16 15:05:40,68,2014-05-16 15:05:40,71,2014-05-16 15:05:40,167,2014-05-16 15:05:44

In [30]:
# Change site1, ..., site10 columns type to integer and fill NA-values with zeros
sites = ['site'+str(i) for i in range(1, 11)]
train_df[sites] = train_df[sites].fillna(0).astype('int')
test_df[sites] = test_df[sites].fillna(0).astype('int')

# Load websites dictionary
with open(r"../src/site_dic.pkl", "rb") as input_file:
    site_dict = pickle.load(input_file)
    
# r before a string means "raw", i.e. take the string as it comes,
# e.g. as a file path without interpreting special symbols like \n

print('Websites total:', len(site_dict))

Websites total: 48371

In [32]:
# See what's in the dict
list(site_dict.items())[:3]

[('www.abmecatronique.com', 25075),
 ('groups.live.com', 13997),
 ('majeureliguefootball.wordpress.com', 42436)]

In [103]:
# The inverse dictionary:

new_dict = {}
for key in site_dict:
    new_dict[site_dict[key]] = key

In [104]:
# See what's in the dict
list(new_dict.items())[:3]

[(25075, 'www.abmecatronique.com'),
 (13997, 'groups.live.com'),
 (42436, 'majeureliguefootball.wordpress.com')]

## Task_1

Какой процент сессий Элис из всех сессий?

In [36]:
train_df.target.value_counts(normalize=True)

0    0.990941
1    0.009059
Name: target, dtype: float64

## Task_2

В какой день недели Элис появилась в первый раз?

In [49]:
train_df.query("target == 1")[times].min().dt.day_name()

time1     Friday
time2     Friday
time3     Friday
time4     Friday
time5     Friday
time6     Friday
time7     Friday
time8     Friday
time9     Friday
time10    Friday
dtype: object

## Task_3

Какие года присутствуют в обучающей выборке?

In [71]:
train_df['time1'].dt.year.unique()

array([2014, 2013])

## Task_4

Какой сайт в обучающей выборке чаще всего посещает первым Элис и обычный пользователь?

In [94]:
train_df \
    .query("target == 1") \
    .groupby(['site1'], as_index=False) \
    .agg({'time1': 'count'}) \
    .rename(columns={'time1': 'cnt'}) \
    .sort_values('cnt', ascending=False) \
    .head(2)

    site1  cnt
33     80  142
31     77  141

In [105]:
new_dict[80]

's.youtube.com'

In [95]:
train_df \
    .query("target == 0") \
    .groupby(['site1'], as_index=False) \
    .agg({'time1': 'count'}) \
    .rename(columns={'time1': 'cnt'}) \
    .sort_values('cnt', ascending=False) \
    .head(2)

    site1    cnt
20     21  13794
22     23   9193

In [106]:
new_dict[21]

'www.google.fr'

## Task_5

Какой сайт в обучающей выборке является вторым по популярности в 2014 году и сколько раз его посещали в 2014 году?

In [109]:
sites = ['site'+str(i) for i in range(1,11)]
sites

['site1',
 'site2',
 'site3',
 'site4',
 'site5',
 'site6',
 'site7',
 'site8',
 'site9',
 'site10']

In [116]:
train_df[(train_df['time1'] > "2014-01-01") & (train_df['time1'] < "2014-12-31")][sites] \
    .stack() \
    .value_counts()

21       86090
0        81887
782      77039
23       56333
780      40610
         ...
1758         1
5232         1
16879        1
18926        1
10543        1
Length: 33244, dtype: int64

In [117]:
new_dict[782]

'annotathon.org'

## Task_6

Сколько всего сессий обучающей выборке содержат в себе меньше чем 10 сайтов?

In [135]:
train_df['cnt_sites'] = train_df[sites].where(lambda x: x != 0).count(axis='columns')
train_df.query("cnt_sites < 10").shape

(22509, 22)

## Task_7

Выберите верные утверждения для обучающей выборки:

* Элис наиболее активна в марте и неактивна летом
* В среднем Элис проводит меньше времени на первой странице, чем другие пользователи
* Лето является самым малоактивным временем года вообще
* Медианная длительность посещения первой страницы в среднем больше, чем у Элис

In [141]:
train_df.query("target == 1").time1.dt.month_name().value_counts().sort_values()

January      88
April       305
March       399
November    446
February    449
December    610
Name: time1, dtype: int64

In [146]:
train_df['delta_1'] = (train_df['time1'] - train_df['time2']).dt.seconds

train_df.query("target == 1").delta_1.mean(), train_df.query("target == 0").delta_1.mean()

(46357.33347863993, 52988.56342109086)

In [147]:
train_df.time1.dt.month_name().value_counts().sort_values()

May            87
January     28058
November    31118
April       42358
December    43557
February    53108
March       55275
Name: time1, dtype: int64

In [148]:
train_df.query("target == 1").delta_1.median(), train_df.query("target == 0").delta_1.median()

(86375.0, 86378.0)

## Task_8

Чему равное медианное значение количества уникальных сайтов в рамках одной сессии обучающей выборки?

In [149]:
train_df['cnt_uniq_sites'] = train_df[sites].where(lambda x: x != 0).nunique(axis='columns')

In [151]:
train_df['cnt_uniq_sites'].median()

6.0

## Task_9

9) Чему равное медианное значение времени сессии в обучающей выборке (время посещения последнего сайта примем равным нулю)?

In [152]:
train_df

,site1,time1,site2,time2,site3,time3,site4,time4,site5,time5,...,site8,time8,site9,time9,site10,time10,target,cnt_sites,delta_1,cnt_uniq_sites
session_id,,,,,,,,,,,,,,,,,,,,,
1,718,2014-02-20 10:02:45,0,NaT,0,NaT,0,NaT,0,NaT,...,0,NaT,0,NaT,0,NaT,0,1,NaN,1
2,890,2014-02-22 11:19:50,941,2014-02-22 11:19:50,3847,2014-02-22 11:19:51,941,2014-02-22 11:19:51,942,2014-02-22 11:19:51,...,3846,2014-02-22 11:19:52,1516,2014-02-22 11:20:15,1518,2014-02-22 11:20:16,0,10,0.0,7
3,14769,2013-12-16 16:40:17,39,2013-12-16 16:40:18,14768,2013-12-16 16:40:19,14769,2013-12-16 16:40:19,37,2013-12-16 16:40:19,...,14768,2013-12-16 16:40:21,14768,2013-12-16 16:40:22,14768,2013-12-16 16:40:24,0,10,86399.0,4
4,782,2014-03-28 10:52:12,782,2014-03-28 10:52:42,782,2014-03-28 10:53:12,782,2014-03-28 10:53:42,782,2014-03-28 10:54:12,...,782,2014-03-28 10:55:42,782,2014-03-28 10:56:12,782,2014-03-28 10:56:42,0,10,86370.0,1
5,22,2014-02-28 10:53:05,177,2014-02-28 10:55:22,175,2014-02-28 10:55:22,178,2014-02-28 10:55:23,177,2014-02-28 10:55:23,...,177,2014-02-28 10:55:59,177,2014-02-28 10:57:06,178,2014-02-28 10:57:11,0,10,86263.0,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
253557,3474,2013-11-25 10:26:54,3474,2013-11-25 10:26:58,141,2013-11-25 10:27:03,2428,2013-11-25 10:27:04,106,2013-11-25 10:27:13,...,2428,2013-11-25 10:27:40,2428,2013-11-25 10:27:52,148,2013-11-25 10:27:53,0,10,86396.0,5
253558,12727,2013-12-03 16:01:15,12727,2013-12-03 16:01:16,2215,2013-12-03 16:01:16,38,2013-12-03 16:01:17,2215,2013-12-03 16:01:17,...,2215,2013-12-03 16:01:18,23,2013-12-03 16:01:18,21,2013-12-03 16:01:18,0,10,86399.0,6
253559,2661,2013-12-09 14:05:03,15004,2013-12-09 14:05:10,5562,2013-12-09 14:05:10,5562,2013-12-09 14:06:29,5562,2013-12-09 14:06:30,...,0,NaT,0,NaT,0,NaT,0,5,86393.0,3
253560,812,2013-12-19 15:20:22,676,2013-12-19 15:20:22,814,2013-12-19 15:20:22,22,2013-12-19 15:20:22,39,2013-12-19 15:20:22,...,570,2013-12-19 15:20:23,22,2013-12-19 15:20:24,570,2013-12-19 15:20:24,0,10,0.0,6
253561,34942,2014-04-25 09:56:52,1429,2014-04-25 09:56:53,34942,2014-04-25 09:56:53,29,2014-04-25 09:56:54,30,2014-04-25 09:56:54,...,30,2014-04-25 09:56:55,35,2014-04-25 09:56:55,33,2014-04-25 09:56:55,0,10,86399.0,7

In [162]:
def f_9(r):
    if r['cnt_sites'] < 2:
        return 0
    else:
        cnt_sites = r['cnt_sites']
        return (r[f'time{cnt_sites}'] - r['time1']).seconds

train_df['total_session_time'] = train_df.apply(lambda row: f_9(row), axis=1)

In [164]:
train_df['total_session_time'].median()

27.0

## Task_10

В каком месяце доля сессий Элис среди всех наибольшая?

In [217]:
train_df.query("target == 1").time1.dt.month_name().value_counts().sort_values()

January      88
April       305
March       399
November    446
February    449
December    610
Name: time1, dtype: int64

In [218]:
train_df['month_1'] = train_df['time1'].dt.month_name()

In [219]:
train_df \
    .groupby(['month_1', 'target']) \
    .agg({'time1': 'count'})

                 time1
month_1  target
April    0       42053
         1         305
December 0       42947
         1         610
February 0       52659
         1         449
January  0       27970
         1          88
March    0       54876
         1         399
May      0          87
November 0       30672
         1         446

In [220]:
df_10 = train_df \
    .groupby(['month_1', 'target']) \
    .agg({'time1': 'count'}) \
    .unstack(level=1)

df_10

            time1
target          0      1
month_1
April     42053.0  305.0
December  42947.0  610.0
February  52659.0  449.0
January   27970.0   88.0
March     54876.0  399.0
May          87.0    NaN
November  30672.0  446.0

In [223]:
new_10 = df_10.xs(axis=1, level=0, key='time1').reset_index()
new_10

target   month_1        0      1
0          April  42053.0  305.0
1       December  42947.0  610.0
2       February  52659.0  449.0
3        January  27970.0   88.0
4          March  54876.0  399.0
5            May     87.0    NaN
6       November  30672.0  446.0

In [228]:
new_10['per'] = (new_10[1] / new_10[0]) * 100
new_10

target   month_1        0      1       per
0          April  42053.0  305.0  0.725275
1       December  42947.0  610.0  1.420355
2       February  52659.0  449.0  0.852656
3        January  27970.0   88.0  0.314623
4          March  54876.0  399.0  0.727094
5            May     87.0    NaN       NaN
6       November  30672.0  446.0  1.454095